Tekla.Structures.Geometry3d.Arc
Represents an arc geometry

Tekla.Structures.Geometry3d.Arc.Length
Returns the length of the arc

Tekla.Structures.Geometry3d.Arc.StartPoint
Gets or sets start point of the arc.

Tekla.Structures.Geometry3d.Arc.EndPoint
Gets or sets end point of the arc.

Tekla.Structures.Geometry3d.Arc.Clone
Returns a copy of itself
Returns: The copy

Tekla.Structures.Geometry3d.Arc.CenterPoint
Gets or sets center point of the arc.

Tekla.Structures.Geometry3d.Arc.ArcMiddlePoint
Gets the point located at the middle of the arc

Tekla.Structures.Geometry3d.Arc.Normal
Gets normal of the arc, which defines the axis of rotation of the radial vector pointing to the start point
of the arc.

Tekla.Structures.Geometry3d.Arc.Angle
Gets angle of the arc in radians.

Tekla.Structures.Geometry3d.Arc.Radius
Gets the radius of the arc.

Tekla.Structures.Geometry3d.Arc.StartTangent
Gets the unit vector tangent to the start point which defines the Y axis of the arc coordinate system

Tekla.Structures.Geometry3d.Arc.StartDirection
Gets the unit vector which points from the center point to the start point of the arc, which defines the
X axis of the arc coordinate system.

Tekla.Structures.Geometry3d.Arc.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Constructs a new arc geometry
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point that defines the arc.
Throws System.ArgumentException: Throws when input points are not defined correctly

Tekla.Structures.Geometry3d.Arc.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double)
Constructs a new arc geometry
centerPoint: Center point of the arc.
startPoint: StartPoint point of the arc.
normal: Normal vector of the arc, defines the axis of rotation of the start vector.
deltaAngleRadians: Angle of the arc in radians. From 0 to 2*PI.
Throws System.ArgumentException: Throws when input values are not defined correctly

Tekla.Structures.Geometry3d.Arc.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Double,System.Double)
Constructs a new arc geometry
centerPoint: Center point of the arc.
startDirection: Direction vector pointing from the center towards the start point of the arc.
startTangent: Vector tangent to the arc at its start point, pointing towards the arc.
radius: Radius of the arc
deltaAngleRadians: Angle of the arc in radians. From 0 to 2*PI.
Throws System.ArgumentException: Throws when input values are not defined correctly

Tekla.Structures.Geometry3d.Arc.Equals(System.Object)
Checks for equality with another arc
other: Other arc
Returns: True if equal, false otherwise

Tekla.Structures.Geometry3d.Arc.Equals(Tekla.Structures.Geometry3d.ICurve)
Checks for equality with another curve
other: Other curve
Returns: True if the other curve is an arc and is equal to this

Tekla.Structures.Geometry3d.Arc.GetHashCode
Get HashCode override
Returns: